#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eatthis-ch/eatthis-ch/runs/run-PbzgxpztfX8t9Qoo

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_vpc.k8s will be created
  + resource "digitalocean_vpc" "k8s" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "10.123.0.0/16"
      + name       = "eatthis-ch-core-vpc"
      + region     = "ams3"
      + urn        = (known after apply)
    }

  # module.terraform_digitalocean_doks_full.module.terraform-digitalocean-doks.digitalocean_kubernetes_cluster.k8s will be created
  + resource "digitalocean_kubernetes_cluster" "k8s" {
      + auto_upgrade   = false
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "eatthis-ch-doks-dev"
      + region         = "ams3"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + tags           = [
          + "kubernetes",
        ]
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.21.2-do.2"
      + vpc_uuid       = (known after apply)

      + maintenance_policy {
          + day        = (known after apply)
          + duration   = (known after apply)
          + start_time = (known after apply)
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + labels            = {
              + "service" = "kubernetes"
            }
          + max_nodes         = 5
          + min_nodes         = 1
          + name              = "eatthis-ch-doks-dev-core"
          + node_count        = 1
          + nodes             = (known after apply)
          + size              = "s-1vcpu-2gb"
          + tags              = [
              + "kubernetes",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @the-technat, Action: `pull_request`*